RIET/src/Tasks/TripsNonLawsonApproval/TripsNonLawsonApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>TripsNonLawsonApproval</name>
  <basedOn>Document.TripNonLawsonCompanies</basedOn>
  <addressing>InformationRegister.TripsNonLawsonApprovalManagers</addressing>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>InformationForApproval</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.StatusesOfApproval</types>
    </type>
  </attributes>
  <attributes>
    <name>ReasonOfRejection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PreviouslyApprovedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>PreviouslyApproved</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>ApprovalManager</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevels</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

RIET/src/InformationRegisters/StagesOfTripsNonLawsonCompanies/StagesOfTripsNonLawsonCompanies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>StagesOfTripsNonLawsonCompanies</name>
  <resources>
    <name>Stage</name>
    <type>
      <types>EnumRef.TripNonLawsonCompaniesStages</types>
    </type>
  </resources>
  <resources>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Trip</name>
    <type>
      <types>DocumentRef.TripNonLawsonCompanies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/TripsNonLawsonApprovalManagers/TripsNonLawsonApprovalManagers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TripsNonLawsonApprovalManagers</name>
  <dimensions>
    <name>ApprovalManager</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevels</types>
    </type>
  </dimensions>
  <dimensions>
    <name>NotificationOnPending</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/BaseCostsSumLimitForApproval/BaseCostsSumLimitForApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BaseCostsSumLimitForApproval</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>LimitForApprovalLevel1ManualPlanning</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>LimitForApprovalLevel1AutomaticPlanning</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>LimitForApprovalLevel2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

RIET/src/Enums/ApprovalLevels/ApprovalLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ApprovalLevels</name>
  <enumValues>
    <name>Level1</name>
  </enumValues>
  <enumValues>
    <name>Level2</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/StatusesOfApproval/StatusesOfApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>StatusesOfApproval</name>
  <enumValues>
    <name>SentForApproval</name>
  </enumValues>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>Rejected</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/TripNonLawsonCompaniesStages/TripNonLawsonCompaniesStages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TripNonLawsonCompaniesStages</name>
  <enumValues>
    <name>Draft</name>
  </enumValues>
  <enumValues>
    <name>Saved_AwaitingServiceProvidersCosts</name>
  </enumValues>
  <enumValues>
    <name>Saved_ApprovalIsNotRequired</name>
  </enumValues>
  <enumValues>
    <name>Saved_ApprovalIsRequired</name>
  </enumValues>
  <enumValues>
    <name>AwaitingApproval</name>
  </enumValues>
  <enumValues>
    <name>Approved</name>
  </enumValues>
  <enumValues>
    <name>Rejected</name>
  </enumValues>
  <enumValues>
    <name>Closed</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ColoursUpdater</name>
      <description>Colours updater</description>
    </items>
    <items>
      <name>ExportRequestsLoader</name>
      <description>Export requests loader</description>
    </items>
  </predefined>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowNamesAndDescriptionsRUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаПодписи</name>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Borgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Tasks/TripsNonLawsonApproval/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.TripNonLawsonCompanies") Тогда
		Trip = ДанныеЗаполнения.Ссылка;
		Specialist = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ApprovalLevel) Тогда 
		ApprovalLevel = Перечисления.ApprovalLevels.Level1;
	КонецЕсли;
	
	ПроверитьВозвожностьИзменения(Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Specialist) Тогда
		Specialist = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда 
		
		Status = Перечисления.StatusesOfApproval.Canceled;
		Выполнена = Ложь;
		ApprovalManager = Неопределено;
		ExecutionDate = Неопределено;
		ReasonOfRejection = Неопределено;
		ApprovalLevel = Неопределено;
		PreviouslyApproved = Неопределено;
		PreviouslyApprovedBy = Неопределено;
		
	иначе
		
		Если Не Выполнена Тогда
			Status = Перечисления.StatusesOfApproval.SentForApproval;
			Дата = ТекущаяДата();	
		КонецЕсли;
		
		InformationForApproval = СокрЛП(InformationForApproval);
		ReasonOfRejection = СокрЛП(ReasonOfRejection);
			
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьВозвожностьИзменения(Отказ)
	         	
	TripStage = РегистрыСведений.StagesOfTripsNonLawsonCompanies.ОпределитьStage(Trip);
	ДополнительныеСвойства.Вставить("TripStage", TripStage);
	
	Если TripStage = Перечисления.TripNonLawsonCompaniesStages.Closed Тогда 
		
		Сообщить("Trip was closed / Поставка закрыта!");
		Отказ = Истина;
		
	ИначеЕсли Не ПометкаУдаления
		И (TripStage = Перечисления.TripNonLawsonCompaniesStages.Draft
		ИЛИ TripStage = Перечисления.TripNonLawsonCompaniesStages.Saved_ApprovalIsNotRequired) Тогда 
		
		Сообщить("Approval is not required / Утверждение не требуется!");
		Отказ = Истина;
		
	ИначеЕсли Не ПометкаУдаления
		И Status = Перечисления.StatusesOfApproval.SentForApproval
		И TripStage = Перечисления.TripNonLawsonCompaniesStages.AwaitingApproval Тогда 
		
		Сообщить("Approval was sent / Утверждение было отправлено!");
		Отказ = Истина;

	ИначеЕсли Не ПометкаУдаления И Выполнена
		И Status = Перечисления.StatusesOfApproval.Approved 
		И TripStage = Перечисления.TripNonLawsonCompaniesStages.Approved Тогда 
		
		Сообщить("Already approved / Утверждено ранее!");
		Отказ = Истина;

	ИначеЕсли Не ПометкаУдаления И Выполнена
		И Status = Перечисления.StatusesOfApproval.Rejected 
		И TripStage = Перечисления.TripNonLawsonCompaniesStages.Rejected Тогда 
		
		Сообщить("Already rejected / Отклонено ранее!");
		Отказ = Истина;
		
	ИначеЕсли ПометкаУдаления 
		И Status = Перечисления.StatusesOfApproval.Canceled Тогда 
		
		Сообщить("Already canceled / Отменено ранее!");
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередВыполнением(Отказ)
	      		
	Если ПометкаУдаления Тогда 
		
		Сообщить("Approval was canceled / Утверждение было отменено!");
		Отказ = Истина;

	КонецЕсли;

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;

	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ApprovalLevel", ApprovalLevel);
	Запрос.УстановитьПараметр("ApprovalManager", ТекПользователь);

	Запрос.Текст = "ВЫБРАТЬ
	               |	TripsNonLawsonApprovalManagers.ApprovalManager
	               |ИЗ
	               |	РегистрСведений.TripsNonLawsonApprovalManagers КАК TripsNonLawsonApprovalManagers
	               |ГДЕ
	               |	TripsNonLawsonApprovalManagers.ApprovalLevel = &ApprovalLevel
	               |	И TripsNonLawsonApprovalManagers.ApprovalManager = &ApprovalManager";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		ApprovalManager = ТекПользователь;
		ExecutionDate = ТекущаяДата();
		
	иначе
		
		Сообщить("You do not have rights for current approval level / Нет прав на текущий уровень утверждения!");
		Отказ = Истина;
		
	КонецЕсли;
	  		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ОбновитьStageTrip();
	
	ОтправитьУведомление();
	
КонецПроцедуры

Процедура ОбновитьStageTrip()
	
	УстановитьПривилегированныйРежим(Истина);
	
	NewStage = РегистрыСведений.StagesOfTripsNonLawsonCompanies.ПолучитьTripStage(Trip);
	
	Если Не ДополнительныеСвойства.Свойство("TripStage") 
		ИЛИ ДополнительныеСвойства.TripStage = NewStage Тогда
		Возврат;
	КонецЕсли;
	  		
	МенеджерЗаписи = РегистрыСведений.StagesOfTripsNonLawsonCompanies.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Trip = Trip;
	МенеджерЗаписи.Stage = NewStage;                          
	МенеджерЗаписи.ModificationDate = ТекущаяДата();
	МенеджерЗаписи.Записать(Истина);
	   	
КонецПроцедуры

Процедура ОтправитьУведомление()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Status = Перечисления.StatusesOfApproval.SentForApproval Тогда
		
		Тема = СокрЛП(Trip) + " requires approval ";
		Тело = СокрЛП(Trip) + " was sent for approval by " + ПараметрыСеанса.ТекущийПользователь;
		
		Адрес = ПолучитьАдресApprovalManager();
		
	ИначеЕсли Status = Перечисления.StatusesOfApproval.Canceled Тогда

		Тема = СокрЛП(Trip) + " approval was canceled ";
		Тело = СокрЛП(Trip) + " approval was canceled by " + ПараметрыСеанса.ТекущийПользователь;
				
		Адрес = ПолучитьАдресApprovalManager();
		
	ИначеЕсли Status = Перечисления.StatusesOfApproval.Approved Тогда
		
		Тема = СокрЛП(Trip) + " approved ";
		Тело = СокрЛП(Trip) + " approved by " + ПараметрыСеанса.ТекущийПользователь;
				
		Адрес = ПолучитьАдресSpecialist();
		
	ИначеЕсли Status = Перечисления.StatusesOfApproval.Rejected Тогда
		
		Тема = СокрЛП(Trip) + " rejected ";
		Тело = СокрЛП(Trip) + " rejected by " + ПараметрыСеанса.ТекущийПользователь;
		
		Адрес = ПолучитьАдресSpecialist();
		
	КонецЕсли;
	
	Тело = ДобавитьСсылкуНаApproval(Тело);
	
	Если ЗначениеЗаполнено(Адрес) Тогда 
		РГСофт.ЗарегистрироватьПочтовоеСообщение(Адрес, Тема, Тело);
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьАдресSpecialist()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Trip", Trip);
	Запрос.УстановитьПараметр("Specialist", Specialist);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	TripNonLawsonCompanies.Specialist.EMail КАК EMail
	               |ИЗ
	               |	Документ.TripNonLawsonCompanies КАК TripNonLawsonCompanies
	               |ГДЕ
	               |	TripNonLawsonCompanies.Ссылка = &Trip
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	Пользователи.EMail
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Ссылка = &Specialist";
	
	МассивEmails = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("EMail");
	
	Возврат РГСофтКлиентСервер.ПолучитьСтрокуИзМассиваПодстрокСокрЛП(МассивEmails, ";");
		
КонецФункции

Функция ПолучитьАдресApprovalManager()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ApprovalLevel", ApprovalLevel);
	Запрос.Текст = "ВЫБРАТЬ
	               |	TripsNonLawsonApprovalManagers.ApprovalManager.EMail КАК EMail
	               |ИЗ
	               |	РегистрСведений.TripsNonLawsonApprovalManagers КАК TripsNonLawsonApprovalManagers
	               |ГДЕ
	               |	TripsNonLawsonApprovalManagers.ApprovalLevel = &ApprovalLevel";
	
	МассивEmails = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("EMail");
	
	Возврат РГСофтКлиентСервер.ПолучитьСтрокуИзМассиваПодстрокСокрЛП(МассивEmails, ";");
		
КонецФункции

Функция ДобавитьСсылкуНаApproval(Текст)
	  	
	//НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
	//НавигационнаяСсылка = СтрЗаменить(НавигационнаяСсылка, """", "'");
	//ПолнаяСсылка = "http://ru0149app35.dir.slb.com/RIET/#" + НавигационнаяСсылка;
	//HTMLСсылка = "<a href=""" + ПолнаяСсылка + """>" + ПолнаяСсылка + "</a>";
	//Текст = Текст + "<br>
	//	|Link to the approval / Ссылка на утверждение: " + HTMLСсылка;
		
	ПолнаяСсылка = "http://ru0149app35.dir.slb.com/RIET/#e1cib/list/Task.TripsNonLawsonApproval";
	HTMLСсылка = "<a href=""" + ПолнаяСсылка + """>" + ПолнаяСсылка + "</a>";
	Возврат Текст + "<br>
		|
		|Link to the trips approval desktop: " + HTMLСсылка;
		
КонецФункции 

Процедура ПриВыполнении(Отказ)
	
	Если ApprovalLevel = Перечисления.ApprovalLevels.Level2
		Или Status = Перечисления.StatusesOfApproval.Rejected 
		Или Не ТребуетсяУтверждениеLevel2() Тогда
		Возврат;
	КонецЕсли;
	 				
	PreviouslyApprovedBy = ApprovalManager;
	PreviouslyApproved = ExecutionDate;
	
	Выполнена = Ложь;
	ApprovalLevel = Перечисления.ApprovalLevels.Level2;
	
	ApprovalManager = Неопределено;
	ExecutionDate = Неопределено;
	   	
КонецПроцедуры
	
Функция ТребуетсяУтверждениеLevel2()
	
	СтруктураРеквизитовTrip = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Trip, "Дата,BaseCostsSumSLBUSD");
	
	СтруктураBaseCostsSumLimit = РегистрыСведений.BaseCostsSumLimitForApproval.ПолучитьПоследнее(СтруктураРеквизитовTrip.Дата);
	
	Возврат (СтруктураРеквизитовTrip.BaseCostsSumSLBUSD > СтруктураBaseCostsSumLimit.LimitForApprovalLevel2);
	 	
КонецФункции
